In [54]:
import numpy as np
import pandas as pd
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-02-01', np.nan, '2023-03-01', '2023-03-01'],
    'Sales': [100, 150, 200, np.nan, 250, 300],
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Region': ['North', 'North', 'South', 'North', 'North', 'South']
}
df1=pd.DataFrame(data)
df1

         Date  Sales Product Region
0  2023-01-01  100.0       A  North
1  2023-01-01  150.0       B  North
2  2023-02-01  200.0       A  South
3         NaN    NaN       B  North
4  2023-03-01  250.0       A  North
5  2023-03-01  300.0       B  South

### Q1 Compute mean of a series grouped by another series

In [55]:
mean=df1.groupby('Product')['Sales'].mean()
mean

Product
A    183.333333
B    225.000000
Name: Sales, dtype: float64

### Q2Fill an intermittent time series to replace all missing dates with values of previous non-missing date.

In [56]:
df1['Date']=df1['Date'].ffill()
df1

         Date  Sales Product Region
0  2023-01-01  100.0       A  North
1  2023-01-01  150.0       B  North
2  2023-02-01  200.0       A  South
3  2023-02-01    NaN       B  North
4  2023-03-01  250.0       A  North
5  2023-03-01  300.0       B  South

### Q3Perform appropriate year-month string to dates conversion.

In [57]:
df1['Date']=pd.to_datetime(df1['Date'])
df1

        Date  Sales Product Region
0 2023-01-01  100.0       A  North
1 2023-01-01  150.0       B  North
2 2023-02-01  200.0       A  South
3 2023-02-01    NaN       B  North
4 2023-03-01  250.0       A  North
5 2023-03-01  300.0       B  South

### Q4Split a dataset to group by two columns and then sort the aggregated results within the groups

In [58]:
grouped_dataframe=df1.groupby(['Product','Region'])
grouped_dataframe['Sales'].sum().sort_values()

Product  Region
B        North     150.0
A        South     200.0
B        South     300.0
A        North     350.0
Name: Sales, dtype: float64

### Q5 Split a given dataframe into groups with bin counts

In [59]:
bin=[0,100,200,300]
bin_df=pd.cut(np.array(df1['Sales']),bins=bin)
bin_df.value_counts()

(0, 100]      1
(100, 200]    2
(200, 300]    2
Name: count, dtype: int64